<a href="https://colab.research.google.com/github/ckraju/python-data-analytics-2e/blob/master/Chapter_5_Reading_and_Writing_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CHAPTER 5 - READING AND WRITING DATA

## Reading Data in CSV or Text Files

In [1]:
import numpy as np
import pandas as pd

In [2]:
csvframe = pd.read_csv('ch05_01.csv')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [3]:
pd.read_table('ch05_01.csv', sep=',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [4]:
pd.read_csv('ch05_02.csv')

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

In [5]:
pd.read_csv('ch05_02.csv', header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [6]:
pd.read_csv('ch05_02.csv', names=['white','red','blue','green','animal'])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [7]:
pd.read_csv('ch05_03.csv', index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

###  Using RegExp for Parsing TXT Files

In [8]:
pd.read_table('ch05_04.txt', sep='\s+', engine='python')

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [9]:
pd.read_table('ch05_05.txt', sep='\D+', header=None, engine='python')

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

In [10]:
pd.read_table('ch05_06.txt', sep=',', skiprows=[0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

### Reading TXT Files into Parts or Partially

In [11]:
pd.read_csv('ch05_02.csv',skiprows=[2],nrows=3,header=None)

   0  1  2  3     4
0  1  5  2  3   cat
1  2  7  8  5   dog
2  2  2  8  3  duck

### Writing Data in CSV

In [18]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
          index=['red', 'blue', 'yellow', 'white'],
          columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [19]:
frame.to_csv('ch05_07.csv')
frame2 = pd.read_csv('ch05_07.csv')
frame2

  Unnamed: 0  ball  pen  pencil  paper
0        red     0    1       2      3
1       blue     4    5       6      7
2     yellow     8    9      10     11
3      white    12   13      14     15

In [20]:
frame.to_csv('ch05_07b.csv', index=False, header=False)
frame2 = pd.read_csv('ch05_07b.csv')
frame2

    0   1   2   3
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15

In [21]:
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],
              [np.nan,np.nan,np.nan,np.nan,np.nan],
              [np.nan,np.nan,np.nan,np.nan,np.nan],
              [20,np.nan,np.nan,20.0,np.nan],
              [19,np.nan,np.nan,19.0,np.nan]
             ],
                     index=['blue','green','red','white','yellow'],
                     columns=['ball','mug','paper','pen','pencil'])

In [22]:
frame3.to_csv('ch5_08.csv')
frame4 = pd.read_csv('ch5_08.csv')
frame4

  Unnamed: 0  ball  mug  paper   pen  pencil
0       blue   6.0  NaN    NaN   6.0     NaN
1      green   NaN  NaN    NaN   NaN     NaN
2        red   NaN  NaN    NaN   NaN     NaN
3      white  20.0  NaN    NaN  20.0     NaN
4     yellow  19.0  NaN    NaN  19.0     NaN

In [23]:
frame3.to_csv('ch5_09.csv', na_rep = 'NaN')
frame5 = pd.read_csv('ch5_09.csv')
frame5

  Unnamed: 0  ball  mug  paper   pen  pencil
0       blue   6.0  NaN    NaN   6.0     NaN
1      green   NaN  NaN    NaN   NaN     NaN
2        red   NaN  NaN    NaN   NaN     NaN
3      white  20.0  NaN    NaN  20.0     NaN
4     yellow  19.0  NaN    NaN  19.0     NaN

## Reading and Writing HTML Files

### Writing Data in HTML

In [24]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [25]:
frame = pd.DataFrame( np.random.random((4,4)),
                    index = ['white','black','red','blue'],
                    columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.386539  0.313194  0.967288  0.257001
black  0.056310  0.237022  0.465637  0.816541
red    0.062499  0.722218  0.816413  0.514596
blue   0.331024  0.796930  0.188019  0.375128

In [26]:
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')
html = ''.join(s)

In [27]:
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

### Reading Data from an HTML File

In [28]:
web_frames = pd.read_html('myFrame.html')
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.386539  0.313194  0.967288  0.257001
1      black  0.056310  0.237022  0.465637  0.816541
2        red  0.062499  0.722218  0.816413  0.514596
3       blue  0.331024  0.796930  0.188019  0.375128

In [29]:
ranking = pd.read_html('https://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking[0]

     Unnamed: 0        Member  Points  Levels
0             1   BrunoOrsini    2075     NaN
1             2     Berserker     700     NaN
2             3  albertosallu     275     NaN
3             4           Jon     180     NaN
4             5          Mr.Y     180     NaN
..          ...           ...     ...     ...
110         111  Gigi Bertana       5     NaN
111         112       p.barut       5     NaN
112         113  Indri4Africa       5     NaN
113         114     ghirograf       5     NaN
114         115  Marco Corbet       5     NaN

[115 rows x 4 columns]

## Reading and Writing Data on Microsoft Excel Files

In [31]:
pd.read_excel('ch05_data.xlsx')

  Unnamed: 0  white  red  green  black
0          a     12   23     17     18
1          b     22   16     19     18
2          c     14   23     22     21

In [32]:
pd.read_excel('ch05_data.xlsx','Sheet2')

  Unnamed: 0  yellow  purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [33]:
pd.read_excel('ch05_data.xlsx',1)

  Unnamed: 0  yellow  purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [34]:
frame = pd.DataFrame(np.random.random((4,4)),
                    index = ['exp1','exp2','exp3','exp4'],
                    columns = ['Jan2015','Feb2015','Mar2015','Apr2015'])
frame

       Jan2015   Feb2015   Mar2015   Apr2015
exp1  0.504921  0.545335  0.971899  0.595187
exp2  0.063451  0.201157  0.266228  0.771911
exp3  0.813437  0.332747  0.273860  0.723262
exp4  0.853254  0.524058  0.851972  0.093679

In [35]:
frame.to_excel('ch05_data02.xlsx')

## JSON Data

In [36]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['white','black','red','blue'],
                    columns=['up','down','right','left'])
frame.to_json('frame.json')

In [37]:
pd.read_json('frame.json')

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

## The Format HDF5

In [40]:
from pandas.io.pytables import HDFStore

In [41]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['white','black','red','blue'],
                    columns=['up','down','right','left'])
store = HDFStore('ch05_data.h5')
store['obj1'] = frame

In [42]:
frame2 = pd.DataFrame(np.arange(0,8,0.5).reshape(4,4))
frame2

     0    1    2    3
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5
3  6.0  6.5  7.0  7.5

In [43]:
store['obj2'] = frame2

In [44]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: ch05_data.h5

In [45]:
store['obj2']

     0    1    2    3
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5
3  6.0  6.5  7.0  7.5

## Pickle - Python Object Serialization

### Serialize a Python Object with cPickle

In [46]:
#On python3.x cPickle has changed from cPickle to _pickle. Thus in python3.x, you can do the following if you want to use cPickle:
import _pickle as pickle

In [47]:
data = { 'color': ['white','red'], 'value': [5, 7]}
pickled_data = pickle.dumps(data)
pickled_data

b'\x80\x03}q\x00(X\x05\x00\x00\x00colorq\x01]q\x02(X\x05\x00\x00\x00whiteq\x03X\x03\x00\x00\x00redq\x04eX\x05\x00\x00\x00valueq\x05]q\x06(K\x05K\x07eu.'

In [48]:
print(pickled_data)

b'\x80\x03}q\x00(X\x05\x00\x00\x00colorq\x01]q\x02(X\x05\x00\x00\x00whiteq\x03X\x03\x00\x00\x00redq\x04eX\x05\x00\x00\x00valueq\x05]q\x06(K\x05K\x07eu.'

In [49]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

### Pickling with pandas

In [50]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['up','down','left','right'])
frame.to_pickle('frame.pkl')

In [51]:
pd.read_pickle('frame.pkl')

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

## Interacting with Databases

In [52]:
from sqlalchemy import create_engine

In [53]:
engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

### Loading and Writing Data with SQLite3

In [54]:
frame = pd.DataFrame(np.arange(20).reshape(4,5),
                    columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19

In [55]:
engine = create_engine('sqlite:///foo.db')

In [56]:
frame.to_sql('colors',engine)

In [57]:
pd.read_sql('colors',engine)

   index  white  red  blue  black  green
0      0      0    1     2      3      4
1      1      5    6     7      8      9
2      2     10   11    12     13     14
3      3     15   16    17     18     19

In [58]:
import sqlite3
query = """
         CREATE TABLE test
         (a VARCHAR(20), b VARCHAR(20),
          c REAL,        d INTEGER
         );"""
con = sqlite3.connect(':memory:')
con.execute(query)

In [59]:
con.commit()

In [60]:
data = [('white','up',1,3),
        ('black','down',2,8),
        ('green','up',4,4),
        ('red','down',5,5)]
stmt = "INSERT INTO test VALUES(?,?,?,?)"
con.executemany(stmt, data)

In [61]:
con.commit()

In [62]:
cursor = con.execute('select * from test')
cursor

In [63]:
rows = cursor.fetchall()
rows

[('white', 'up', 1.0, 3),
 ('black', 'down', 2.0, 8),
 ('green', 'up', 4.0, 4),
 ('red', 'down', 5.0, 5)]

In [64]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [66]:
pd.DataFrame(rows, columns=list(zip(*cursor.description))[0])

       a     b    c  d
0  white    up  1.0  3
1  black  down  2.0  8
2  green    up  4.0  4
3    red  down  5.0  5